I (obviously?) don't have that subnet, so I ran this instead:

```hcl
resource "opentelekomcloud_vpc_v1" "this" {
  name = "nfelger-test-1"
  cidr = "10.0.0.0/20"
}

resource "opentelekomcloud_vpc_subnet_v1" "this" {
  name   = "nfelger-test-1"
  cidr   = cidrsubnet(opentelekomcloud_vpc_v1.this.cidr, 4, 1)
  vpc_id = opentelekomcloud_vpc_v1.this.id

  gateway_ip = cidrhost(cidrsubnet(opentelekomcloud_vpc_v1.this.cidr, 4, 1), 1)
}

resource "opentelekomcloud_lb_loadbalancer_v3" "this" {
  admin_state_up = true
  availability_zones = [
    "eu-de-01",
  ]
  network_ids = [
    opentelekomcloud_vpc_subnet_v1.this.network_id
  ]
  router_id = opentelekomcloud_vpc_subnet_v1.this.vpc_id
  subnet_id = opentelekomcloud_vpc_subnet_v1.this.subnet_id

  public_ip {
    bandwidth_name       = "lb-bandwidth"
    ip_type              = "5_gray"
    bandwidth_size       = 10
    bandwidth_share_type = "PER"
  }
}
```

This one completes fine, without any problems:
```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opentelekomcloud_lb_loadbalancer_v3.this will be created
  + resource "opentelekomcloud_lb_loadbalancer_v3" "this" {
      + admin_state_up     = true
      + availability_zones = [
          + "eu-de-01",
        ]
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ip_target_enable   = (known after apply)
      + l4_flavor          = (known after apply)
      + l7_flavor          = (known after apply)
      + network_ids        = (known after apply)
      + router_id          = (known after apply)
      + subnet_id          = (known after apply)
      + updated_at         = (known after apply)
      + vip_address        = (known after apply)
      + vip_port_id        = (known after apply)

      + public_ip {
          + _managed              = (known after apply)
          + address               = (known after apply)
          + bandwidth_charge_mode = "traffic"
          + bandwidth_name        = "lb-bandwidth"
          + bandwidth_share_type  = "PER"
          + bandwidth_size        = 10
          + id                    = (known after apply)
          + ip_type               = "5_gray"
        }
    }

  # opentelekomcloud_vpc_subnet_v1.this will be created
  + resource "opentelekomcloud_vpc_subnet_v1" "this" {
      + availability_zone = (known after apply)
      + cidr              = "10.0.1.0/24"
      + dhcp_enable       = true
      + dns_list          = (known after apply)
      + gateway_ip        = "10.0.1.1"
      + id                = (known after apply)
      + name              = "nfelger-test-1"
      + network_id        = (known after apply)
      + primary_dns       = (known after apply)
      + region            = (known after apply)
      + secondary_dns     = (known after apply)
      + subnet_id         = (known after apply)
      + vpc_id            = (known after apply)
    }

  # opentelekomcloud_vpc_v1.this will be created
  + resource "opentelekomcloud_vpc_v1" "this" {
      + cidr   = "10.0.0.0/20"
      + id     = (known after apply)
      + name   = "nfelger-test-1"
      + region = (known after apply)
      + shared = (known after apply)
      + status = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opentelekomcloud_vpc_v1.this: Creating...
opentelekomcloud_vpc_v1.this: Creation complete after 6s [id=f571786d-9376-4fec-8f2b-55b5a905abfc]
opentelekomcloud_vpc_subnet_v1.this: Creating...
opentelekomcloud_vpc_subnet_v1.this: Creation complete after 8s [id=a87c0f89-436f-4789-a667-8c3d73769f52]
opentelekomcloud_lb_loadbalancer_v3.this: Creating...
opentelekomcloud_lb_loadbalancer_v3.this: Creation complete after 2s [id=e13211f9-1bc4-4459-8d89-6d7056d45056]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

